**About Book Crossing Dataset**<br>

This dataset has been compiled by Cai-Nicolas Ziegler in 2004, and it comprises of three tables for users, books and ratings. Explicit ratings are expressed on a scale from 1-10 (higher values denoting higher appreciation) and implicit rating is expressed by 0.

Reference: http://www2.informatik.uni-freiburg.de/~cziegler/BX/

**Objective**

This project entails building a Book Recommender System for users based on user-based and item-based collaborative filtering approaches.

In [127]:
import pandas as pd
import numpy as np
from surprise import KNNWithMeans
from surprise import Dataset
from surprise import accuracy
from surprise import Reader
from surprise.model_selection import train_test_split
from surprise.prediction_algorithms.matrix_factorization import SVD

#### Execute the below cell to load the datasets

In [130]:
#Loading data
books = pd.read_csv("C:/Users/alok.1.pandey/Desktop/AiML/LAB 5/external lab/books.csv", sep=";", error_bad_lines=False, encoding="latin-1")
books.columns = ['ISBN', 'bookTitle', 'bookAuthor', 'yearOfPublication', 'publisher', 'imageUrlS', 'imageUrlM', 'imageUrlL']

users = pd.read_csv('C:/Users/alok.1.pandey/Desktop/AiML/LAB 5/external lab/users.csv', sep=';', error_bad_lines=False, encoding="latin-1")
users.columns = ['userID', 'Location', 'Age']

ratings = pd.read_csv('C:/Users/alok.1.pandey/Desktop/AiML/LAB 5/external lab/ratings.csv', sep=';', error_bad_lines=False, encoding="latin-1")
ratings.columns = ['userID', 'ISBN', 'bookRating']

b'Skipping line 6452: expected 8 fields, saw 9\nSkipping line 43667: expected 8 fields, saw 10\nSkipping line 51751: expected 8 fields, saw 9\n'
b'Skipping line 92038: expected 8 fields, saw 9\nSkipping line 104319: expected 8 fields, saw 9\nSkipping line 121768: expected 8 fields, saw 9\n'
b'Skipping line 144058: expected 8 fields, saw 9\nSkipping line 150789: expected 8 fields, saw 9\nSkipping line 157128: expected 8 fields, saw 9\nSkipping line 180189: expected 8 fields, saw 9\nSkipping line 185738: expected 8 fields, saw 9\n'
b'Skipping line 209388: expected 8 fields, saw 9\nSkipping line 220626: expected 8 fields, saw 9\nSkipping line 227933: expected 8 fields, saw 11\nSkipping line 228957: expected 8 fields, saw 10\nSkipping line 245933: expected 8 fields, saw 9\nSkipping line 251296: expected 8 fields, saw 9\nSkipping line 259941: expected 8 fields, saw 9\nSkipping line 261529: expected 8 fields, saw 9\n'

### Check no.of records and features given in each dataset

In [5]:
!pip install surprise

Collecting surprise
  Downloading https://files.pythonhosted.org/packages/61/de/e5cba8682201fcf9c3719a6fdda95693468ed061945493dea2dd37c5618b/surprise-0.1-py2.py3-none-any.whl
Requirement already satisfied: scikit-surprise in c:\users\alok.1.pandey\appdata\local\continuum\anaconda3\lib\site-packages (from surprise) (1.1.0)
Requirement already satisfied: joblib>=0.11 in c:\users\alok.1.pandey\appdata\local\continuum\anaconda3\lib\site-packages (from scikit-surprise->surprise) (0.13.2)
Requirement already satisfied: numpy>=1.11.2 in c:\users\alok.1.pandey\appdata\local\continuum\anaconda3\lib\site-packages (from scikit-surprise->surprise) (1.16.4)
Requirement already satisfied: scipy>=1.0.0 in c:\users\alok.1.pandey\appdata\local\continuum\anaconda3\lib\site-packages (from scikit-surprise->surprise) (1.2.1)
Requirement already satisfied: six>=1.10.0 in c:\users\alok.1.pandey\appdata\local\continuum\anaconda3\lib\site-packages (from scikit-surprise->surprise) (1.12.0)
Installing collected packages: surprise
Successfully installed surprise-0.1

In [12]:
print (books.shape)
print (users.shape)
print (ratings.shape)

(271360, 8)
(278858, 3)
(1149780, 3)

In [15]:
books.head(10)

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher,imageUrlS,imageUrlM,imageUrlL
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...
5,0399135782,The Kitchen God's Wife,Amy Tan,1991,Putnam Pub Group,http://images.amazon.com/images/P/0399135782.0...,http://images.amazon.com/images/P/0399135782.0...,http://images.amazon.com/images/P/0399135782.0...
6,0425176428,What If?: The World's Foremost Military Histor...,Robert Cowley,2000,Berkley Publishing Group,http://images.amazon.com/images/P/0425176428.0...,http://images.amazon.com/images/P/0425176428.0...,http://images.amazon.com/images/P/0425176428.0...
7,0671870432,PLEADING GUILTY,Scott Turow,1993,Audioworks,http://images.amazon.com/images/P/0671870432.0...,http://images.amazon.com/images/P/0671870432.0...,http://images.amazon.com/images/P/0671870432.0...
8,0679425608,Under the Black Flag: The Romance and the Real...,David Cordingly,1996,Random House,http://images.amazon.com/images/P/0679425608.0...,http://images.amazon.com/images/P/0679425608.0...,http://images.amazon.com/images/P/0679425608.0...
9,074322678X,Where You'll Find Me: And Other Stories,Ann Beattie,2002,Scribner,http://images.amazon.com/images/P/074322678X.0...,http://images.amazon.com/images/P/074322678X.0...,http://images.amazon.com/images/P/074322678X.0...

In [22]:
books.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271360 entries, 0 to 271359
Data columns (total 8 columns):
ISBN                 271360 non-null object
bookTitle            271360 non-null object
bookAuthor           271359 non-null object
yearOfPublication    271360 non-null object
publisher            271358 non-null object
imageUrlS            271360 non-null object
imageUrlM            271360 non-null object
imageUrlL            271357 non-null object
dtypes: object(8)
memory usage: 16.6+ MB

In [23]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 278858 entries, 0 to 278857
Data columns (total 3 columns):
userID      278858 non-null int64
Location    278858 non-null object
Age         168096 non-null float64
dtypes: float64(1), int64(1), object(1)
memory usage: 6.4+ MB

In [24]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1149780 entries, 0 to 1149779
Data columns (total 3 columns):
userID        1149780 non-null int64
ISBN          1149780 non-null object
bookRating    1149780 non-null int64
dtypes: int64(2), object(1)
memory usage: 26.3+ MB

In [17]:
books.describe().transpose()# one record missing in bookauthor and 2 records missing in publisher

,count,unique,top,freq
ISBN,271360,271360,0064407470,1
bookTitle,271360,242135,Selected Poems,27
bookAuthor,271359,102023,Agatha Christie,632
yearOfPublication,271360,202,2002,13903
publisher,271358,16807,Harlequin,7535
imageUrlS,271360,271044,http://images.amazon.com/images/P/034541005X.0...,2
imageUrlM,271360,271044,http://images.amazon.com/images/P/080411109X.0...,2
imageUrlL,271357,271041,http://images.amazon.com/images/P/014070728X.0...,2

In [20]:
users.describe().transpose()# we have outliars like age 244

,count,mean,std,min,25%,50%,75%,max
userID,278858.0,139429.500000,80499.515020,1.0,69715.25,139429.5,209143.75,278858.0
Age,168096.0,34.751434,14.428097,0.0,24.00,32.0,44.00,244.0

In [26]:
ratings.describe().transpose()# Maximum users have given 7 & above rating

,count,mean,std,min,25%,50%,75%,max
userID,1149780.0,140386.395126,80562.277718,2.0,70345.0,141010.0,211028.0,278854.0
bookRating,1149780.0,2.866950,3.854184,0.0,0.0,0.0,7.0,10.0

In [27]:
books.columns

Index(['ISBN', 'bookTitle', 'bookAuthor', 'yearOfPublication', 'publisher',
       'imageUrlS', 'imageUrlM', 'imageUrlL'],
      dtype='object')

In [28]:
users.columns

Index(['userID', 'Location', 'Age'], dtype='object')

In [30]:
ratings.columns

Index(['userID', 'ISBN', 'bookRating'], dtype='object')

## Exploring books dataset

In [13]:
books.head()

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher,imageUrlS,imageUrlM,imageUrlL
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

### Drop last three columns containing image URLs which will not be required for analysis

In [38]:
books.drop(columns=['imageUrlS','imageUrlM','imageUrlL'],inplace = True , axis=1)

KeyError: "['imageUrlS' 'imageUrlM' 'imageUrlL'] not found in axis"

In [41]:
books

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company
5,0399135782,The Kitchen God's Wife,Amy Tan,1991,Putnam Pub Group
6,0425176428,What If?: The World's Foremost Military Histor...,Robert Cowley,2000,Berkley Publishing Group
7,0671870432,PLEADING GUILTY,Scott Turow,1993,Audioworks
8,0679425608,Under the Black Flag: The Romance and the Real...,David Cordingly,1996,Random House
9,074322678X,Where You'll Find Me: And Other Stories,Ann Beattie,2002,Scribner
10,0771074670,Nights Below Station Street,David Adams Richards,1988,Emblem Editions
11,080652121X,Hitler's Secret Bankers: The Myth of Swiss Neu...,Adam Lebor,2000,Citadel Press
12,0887841740,The Middle Stories,Sheila Heti,2004,House of Anansi Press
13,1552041778,Jane Doe,R. J. Kaiser,1999,Mira Books
14,1558746218,A Second Chicken Soup for the Woman's Soul (Ch...,Jack Canfield,1998,Health Communications
15,1567407781,The Witchfinder (Amos Walker Mystery Series),Loren D. Estleman,1998,Brilliance Audio - Trade
16,1575663937,More Cunning Than Man: A Social History of Rat...,Robert Hendrickson,1999,Kensington Publishing Corp.
17,1881320189,Goodbye to the Buttermilk Sky,Julia Oliver,1994,River City Pub
18,0440234743,The Testament,John Grisham,1999,Dell
19,0452264464,Beloved (Plume Contemporary Fiction),Toni Morrison,1994,Plume
20,0609804618,Our Dumb Century: The Onion Presents 100 Years...,The Onion,1999,Three Rivers Press
21,1841721522,New Vegetarian: Bold and Beautiful Recipes for...,Celia Brooks Brown,2001,Ryland Peters &amp; Small Ltd
22,1879384493,If I'd Known Then What I Know Now: Why Not Lea...,J. R. Parrish,2003,Cypress House
23,0061076031,Mary-Kate &amp; Ashley Switching Goals (Mary-K...,Mary-Kate &amp; Ashley Olsen,2000,HarperEntertainment
24,0439095026,Tell Me This Isn't Happening,Robynn Clairday,1999,Scholastic
25,0689821166,Flood : Mississippi 1927,Kathleen Duey,1998,Aladdin
26,0971880107,Wild Animus,Rich Shapero,2004,Too Far
27,0345402871,Airframe,Michael Crichton,1997,Ballantine Books
28,0345417623,Timeline,MICHAEL CRICHTON,2000,Ballantine Books
29,0684823802,OUT OF THE SILENT PLANET,C.S. Lewis,1996,Scribner
...,...,...,...,...,...
271330,3320016822,Urteil ohne Prozess: Margot Honecker gegen Oss...,Jrn Kalkbrenner,1990,Dietz
271331,3423200944,"Hokuspokus, liebe mich. Und f?nfzig andere ...",Helen Glisic,1997,Dtv
271332,3453065123,Ich war Hitlerjunge Salomon. ( erlebt und erfa...,Sally Perel,1993,Heyne
271333,3525335423,Das Deutsche Kaiserreich 1871-1918.,Hans-Ulrich Wehler,1994,Vandenhoeck &amp; Ruprecht
271334,3548740146,Wicca. Eine Einf?hrung in wei??e Magie.,Scott Cunningham,2001,"Ullstein TB-Vlg., B."
271335,381440176X,"Ein Fall f?r TKKG, Bd.50, Sklaven f?r Wu...",Stefan Wolf,1989,Pelikan
271336,3893312307,Die Vereinten Nationen: Zwischen Anspruch und ...,Gnther Unser,1995,Bundeszentrale fr Politische Bildung
271337,0971854823,The Female Power Within: A Guide to Living a G...,Marilyn Graman,2002,Life Works Books
271338,0316640786,Christie's Collectables: Blue and White China ...,Paul Tippett,1997,Time Warner Books UK
271339,3257217323,Schmatz. Oder Die Sackgasse.,Hans Werner Kettenbach,2003,Diogenes Verlag
271340,3596156904,Amok.,Emmanuel Carrere,2003,"Fischer (Tb.), Frankfurt"
271341,1874166633,Introducing Nietzsche (Foundations in Children...,Laurence Gane,1998,Natl Book Network
271342,0130897930,Core Web Programming (2nd Edition),Marty Hall,2001,Prentice Hall PTR
271343,020130998X,The Unified Modeling Language Reference Manual...,James Rumbaugh,1998,Addison-Wesley Professional
271344,2268032019,Petite histoire de la d?sinformation,Vladimir Volkoff,1999,Editions du Rocher
271345,0684860112,Driving to Detroit: Memoirs of a Fast Woman,Lesley Hazleton,1999,Simon &amp; Schuster (Trade Division)
271346,0395264707,Dreamsnake,Vonda N. McIntyre,1978,Houghton Mifflin
271347,3442150663,Der Mossad.,Victor Ostrovsky,2000,Goldmann
271348,0231128444,Slow Food(The Case For Taste),Carlo Petrini,2003,Columbia University Press
271349,0520242335,Strong Democracy : Participatory Politics for ...,Benjamin R. Barber,2004,University of California Press
271350,0762412119,"Burpee Gardening Cyclopedia: A Concise, Up to ...",Allan Armitage,2002,Running Press Book Publishers
271351,1582380805,Tropical Rainforests: 230 Species in Full Colo...,"Allen M., Ph.D. Young",2001,Golden Guides from St. Martin's Press
271352,1845170423,Cocktail Classics,David Biggs,2004,Connaught
271353,014002803X,Anti Death League,Kingsley Amis,1975,Viking Press
271354,0449906736,Flashpoints: Promise and Peril in a New World,Robin Wright,1993,Ballantine Books
271355,0440400988,There's a Bat in Bunk Five,Paula Danziger,1988,Random House Childrens Pub (Mm)
271356,0525447644,From One to One Hundred,Teri Sloat,1991,Dutton Books
271357,006008667X,Lily Dale : The True Story of the Town that Ta...,Christine Wicker,2004,HarperSanFrancisco
271358,0192126040,Republic (World's Classics),Plato,1996,Oxford University Press
271359,0767409752,A Guided Tour of Rene Descartes' Meditations o...,Christopher Biffle,2000,McGraw-Hill Humanities/Social Sciences/Languages

In [40]:
books.head()

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company

**yearOfPublication**

### Check unique values of yearOfPublication

In [44]:
books['yearOfPublication'].unique()

array([2002, 2001, 1991, 1999, 2000, 1993, 1996, 1988, 2004, 1998, 1994,
       2003, 1997, 1983, 1979, 1995, 1982, 1985, 1992, 1986, 1978, 1980,
       1952, 1987, 1990, 1981, 1989, 1984, 0, 1968, 1961, 1958, 1974,
       1976, 1971, 1977, 1975, 1965, 1941, 1970, 1962, 1973, 1972, 1960,
       1966, 1920, 1956, 1959, 1953, 1951, 1942, 1963, 1964, 1969, 1954,
       1950, 1967, 2005, 1957, 1940, 1937, 1955, 1946, 1936, 1930, 2011,
       1925, 1948, 1943, 1947, 1945, 1923, 2020, 1939, 1926, 1938, 2030,
       1911, 1904, 1949, 1932, 1928, 1929, 1927, 1931, 1914, 2050, 1934,
       1910, 1933, 1902, 1924, 1921, 1900, 2038, 2026, 1944, 1917, 1901,
       2010, 1908, 1906, 1935, 1806, 2021, '2000', '1995', '1999', '2004',
       '2003', '1990', '1994', '1986', '1989', '2002', '1981', '1993',
       '1983', '1982', '1976', '1991', '1977', '1998', '1992', '1996',
       '0', '1997', '2001', '1974', '1968', '1987', '1984', '1988',
       '1963', '1956', '1970', '1985', '1978', '1973', '1980', '1979',
       '1975', '1969', '1961', '1965', '1939', '1958', '1950', '1953',
       '1966', '1971', '1959', '1972', '1955', '1957', '1945', '1960',
       '1967', '1932', '1924', '1964', '2012', '1911', '1927', '1948',
       '1962', '2006', '1952', '1940', '1951', '1931', '1954', '2005',
       '1930', '1941', '1944', 'DK Publishing Inc', '1943', '1938',
       '1900', '1942', '1923', '1920', '1933', 'Gallimard', '1909',
       '1946', '2008', '1378', '2030', '1936', '1947', '2011', '2020',
       '1919', '1949', '1922', '1897', '2024', '1376', '1926', '2037'],
      dtype=object)

As it can be seen from above that there are some incorrect entries in this field. It looks like Publisher names 'DK Publishing Inc' and 'Gallimard' have been incorrectly loaded as yearOfPublication in dataset due to some errors in csv file.


Also some of the entries are strings and same years have been entered as numbers in some places. We will try to fix these things in the coming questions.

### Check the rows having 'DK Publishing Inc' as yearOfPublication

In [45]:
books[books['yearOfPublication']=='DK Publishing Inc']

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher
209538,078946697X,"DK Readers: Creating the X-Men, How It All Beg...",2000,DK Publishing Inc,http://images.amazon.com/images/P/078946697X.0...
221678,0789466953,"DK Readers: Creating the X-Men, How Comic Book...",2000,DK Publishing Inc,http://images.amazon.com/images/P/0789466953.0...

### Drop the rows having `'DK Publishing Inc'` and `'Gallimard'` as `yearOfPublication`

In [46]:
list_of_bad_rows_index = list(books[books['yearOfPublication']=='DK Publishing Inc'].index)+list(books[books['yearOfPublication']=='Gallimard'].index)
books.drop(index=list_of_bad_rows_index,axis=0,inplace=True)

In [47]:
books[books['yearOfPublication']=='DK Publishing Inc']

Empty DataFrame
Columns: [ISBN, bookTitle, bookAuthor, yearOfPublication, publisher]
Index: []

In [48]:
books[books['yearOfPublication']=='Gallimard']

Empty DataFrame
Columns: [ISBN, bookTitle, bookAuthor, yearOfPublication, publisher]
Index: []

### Change the datatype of yearOfPublication to 'int'

In [49]:
books=books.astype({'yearOfPublication':int})

In [50]:
books.dtypes

ISBN                 object
bookTitle            object
bookAuthor           object
yearOfPublication     int32
publisher            object
dtype: object

### Drop NaNs in `'publisher'` column

In [51]:
books[books['publisher'].isna()]

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher
128890,193169656X,Tyrant Moon,Elaine Corvidae,2002,NaN
129037,1931696993,Finders Keepers,Linnea Sinclair,2001,NaN

In [55]:
books=books.dropna(subset=['publisher'])

In [56]:
books[books['publisher'].isna()]

Empty DataFrame
Columns: [ISBN, bookTitle, bookAuthor, yearOfPublication, publisher]
Index: []

## Exploring Users dataset

In [21]:
print(users.shape)
users.head()

(278858, 3)

   userID                            Location   Age
0       1                  nyc, new york, usa   NaN
1       2           stockton, california, usa  18.0
2       3     moscow, yukon territory, russia   NaN
3       4           porto, v.n.gaia, portugal  17.0
4       5  farnborough, hants, united kingdom   NaN

### Get all unique values in ascending order for column `Age`

In [57]:
users=users['Age'].unique()
users.sort()
users

array([  0.,   1.,   2.,   3.,   4.,   5.,   6.,   7.,   8.,   9.,  10.,
        11.,  12.,  13.,  14.,  15.,  16.,  17.,  18.,  19.,  20.,  21.,
        22.,  23.,  24.,  25.,  26.,  27.,  28.,  29.,  30.,  31.,  32.,
        33.,  34.,  35.,  36.,  37.,  38.,  39.,  40.,  41.,  42.,  43.,
        44.,  45.,  46.,  47.,  48.,  49.,  50.,  51.,  52.,  53.,  54.,
        55.,  56.,  57.,  58.,  59.,  60.,  61.,  62.,  63.,  64.,  65.,
        66.,  67.,  68.,  69.,  70.,  71.,  72.,  73.,  74.,  75.,  76.,
        77.,  78.,  79.,  80.,  81.,  82.,  83.,  84.,  85.,  86.,  87.,
        88.,  89.,  90.,  91.,  92.,  93.,  94.,  95.,  96.,  97.,  98.,
        99., 100., 101., 102., 103., 104., 105., 106., 107., 108., 109.,
       110., 111., 113., 114., 115., 116., 118., 119., 123., 124., 127.,
       128., 132., 133., 136., 137., 138., 140., 141., 143., 146., 147.,
       148., 151., 152., 156., 157., 159., 162., 168., 172., 175., 183.,
       186., 189., 199., 200., 201., 204., 207., 208., 209., 210., 212.,
       219., 220., 223., 226., 228., 229., 230., 231., 237., 239., 244.,
        nan])

Age column has some invalid entries like nan, 0 and very high values like 100 and above

### Values below 5 and above 90 do not make much sense for our book rating case...hence replace these by NaNs

In [93]:
users = pd.read_csv('C://Users//alok.1.pandey//Desktop//AiML/LAB 5//external lab//users.csv', sep=';', error_bad_lines=False, encoding="latin-1")
users.columns = ['userID', 'Location', 'Age']

In [94]:
users_copy= users.copy()
users.copy()

        userID                                          Location   Age
0            1                                nyc, new york, usa   NaN
1            2                         stockton, california, usa  18.0
2            3                   moscow, yukon territory, russia   NaN
3            4                         porto, v.n.gaia, portugal  17.0
4            5                farnborough, hants, united kingdom   NaN
5            6                     santa monica, california, usa  61.0
6            7                               washington, dc, usa   NaN
7            8                          timmins, ontario, canada   NaN
8            9                        germantown, tennessee, usa   NaN
9           10                        albacete, wisconsin, spain  26.0
10          11                    melbourne, victoria, australia  14.0
11          12                       fort bragg, california, usa   NaN
12          13                       barcelona, barcelona, spain  26.0
13          14                             mediapolis, iowa, usa   NaN
14          15                          calgary, alberta, canada   NaN
15          16                      albuquerque, new mexico, usa   NaN
16          17                         chesapeake, virginia, usa   NaN
17          18            rio de janeiro, rio de janeiro, brazil  25.0
18          19                                         weston, ,  14.0
19          20                      langhorne, pennsylvania, usa  19.0
20          21                    ferrol / spain, alabama, spain  46.0
21          22                       erfurt, thueringen, germany   NaN
22          23                   philadelphia, pennsylvania, usa   NaN
23          24                             cologne, nrw, germany  19.0
24          25                          oakland, california, usa  55.0
25          26                         bellevue, washington, usa   NaN
26          27                            chicago, illinois, usa  32.0
27          28             freiburg, baden-wuerttemberg, germany  24.0
28          29                       cuernavaca, alabama, mexico  19.0
29          30                            anchorage, alaska, usa  24.0
...        ...                                               ...   ...
278828  278829                                 boise, idaho, usa   NaN
278829  278830                         springield, virginia, usa  28.0
278830  278831                            anchorage, alaska, usa   NaN
278831  278832                    new smyrna beach, florida, usa  62.0
278832  278833      hanoi, australian capital territory, vietnam  25.0
278833  278834                           essen, england, germany   NaN
278834  278835                          karachi, sindh, pakistan  18.0
278835  278836                       des moines, washington, usa  47.0
278836  278837                            taiyuan, shanxi, china   NaN
278837  278838                              massillon, ohio, usa  15.0
278838  278839                                austin, texas, usa   NaN
278839  278840                        encinitas, california, usa  45.0
278840  278841  llangollen, denbighshire county, united kingdom.   NaN
278841  278842               perth, western australia, australia   NaN
278842  278843                      pismo beach, california, usa  28.0
278843  278844                          st. paul, minnesota, usa  28.0
278844  278845                       jrvenp, uusimaa, finland   NaN
278845  278846                          toronto, ontario, canada  23.0
278846  278847                           brooklyn, new york, usa   NaN
278847  278848                kln, nordrhein-westfalen, germany   NaN
278848  278849                       georgetown, ontario, canada  23.0
278849  278850                        sergnano, lombardia, italy   NaN
278850  278851                                dallas, texas, usa  33.0
278851  278852                   brisbane, queensland, australia  32.0
278852  278853                    stranraer, n/a, united kingdom  17.0
278853  278854                             portland, oregon, usa   NaN
278854  278855                tacoma, washington, united kingdom  50.0
278855  278856                         brampton, ontario, canada   NaN
278856  278857                         knoxville, tennessee, usa   NaN
278857  278858                              dublin, n/a, ireland   NaN

[278858 rows x 3 columns]

In [95]:
a = np.array(users['Age'].values.tolist())
print (a)
users['Age'] = np.where(a < 5, 0 , a).tolist()
print (users)

[nan 18. nan ... nan nan nan]
        userID                                          Location   Age
0            1                                nyc, new york, usa   NaN
1            2                         stockton, california, usa  18.0
2            3                   moscow, yukon territory, russia   NaN
3            4                         porto, v.n.gaia, portugal  17.0
4            5                farnborough, hants, united kingdom   NaN
5            6                     santa monica, california, usa  61.0
6            7                               washington, dc, usa   NaN
7            8                          timmins, ontario, canada   NaN
8            9                        germantown, tennessee, usa   NaN
9           10                        albacete, wisconsin, spain  26.0
10          11                    melbourne, victoria, australia  14.0
11          12                       fort bragg, california, usa   NaN
12          13                       barcelona, barcelona, spain  26.0
13          14                             mediapolis, iowa, usa   NaN
14          15                          calgary, alberta, canada   NaN
15          16                      albuquerque, new mexico, usa   NaN
16          17                         chesapeake, virginia, usa   NaN
17          18            rio de janeiro, rio de janeiro, brazil  25.0
18          19                                         weston, ,  14.0
19          20                      langhorne, pennsylvania, usa  19.0
20          21                    ferrol / spain, alabama, spain  46.0
21          22                       erfurt, thueringen, germany   NaN
22          23                   philadelphia, pennsylvania, usa   NaN
23          24                             cologne, nrw, germany  19.0
24          25                          oakland, california, usa  55.0
25          26                         bellevue, washington, usa   NaN
26          27                            chicago, illinois, usa  32.0
27          28             freiburg, baden-wuerttemberg, germany  24.0
28          29                       cuernavaca, alabama, mexico  19.0
29          30                            anchorage, alaska, usa  24.0
...        ...                                               ...   ...
278828  278829                                 boise, idaho, usa   NaN
278829  278830                         springield, virginia, usa  28.0
278830  278831                            anchorage, alaska, usa   NaN
278831  278832                    new smyrna beach, florida, usa  62.0
278832  278833      hanoi, australian capital territory, vietnam  25.0
278833  278834                           essen, england, germany   NaN
278834  278835                          karachi, sindh, pakistan  18.0
278835  278836                       des moines, washington, usa  47.0
278836  278837                            taiyuan, shanxi, china   NaN
278837  278838                              massillon, ohio, usa  15.0
278838  278839                                austin, texas, usa   NaN
278839  278840                        encinitas, california, usa  45.0
278840  278841  llangollen, denbighshire county, united kingdom.   NaN
278841  278842               perth, western australia, australia   NaN
278842  278843                      pismo beach, california, usa  28.0
278843  278844                          st. paul, minnesota, usa  28.0
278844  278845                       jrvenp, uusimaa, finland   NaN
278845  278846                          toronto, ontario, canada  23.0
278846  278847                           brooklyn, new york, usa   NaN
278847  278848                kln, nordrhein-westfalen, germany   NaN
278848  278849                       georgetown, ontario, canada  23.0
278849  278850                        sergnano, lombardia, italy   NaN
278850  278851                                dallas, texas, usa  33.0
278851  278852                   brisbane, queensland, australia  32.0
278852  278853                    stranraer, n/a, united kingdom  17.0
278853  278854                             portland, oregon, usa   NaN
278854  278855                tacoma, washington, united kingdom  50.0
278855  278856                         brampton, ontario, canada   NaN
278856  278857                         knoxville, tennessee, usa   NaN
278857  278858                              dublin, n/a, ireland   NaN

[278858 rows x 3 columns]

C:\Users\alok.1.pandey\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:3: RuntimeWarning: invalid value encountered in less
  This is separate from the ipykernel package so we can avoid doing imports until

In [96]:
users=users['Age'].unique()
users.sort()
users

array([  0.,   5.,   6.,   7.,   8.,   9.,  10.,  11.,  12.,  13.,  14.,
        15.,  16.,  17.,  18.,  19.,  20.,  21.,  22.,  23.,  24.,  25.,
        26.,  27.,  28.,  29.,  30.,  31.,  32.,  33.,  34.,  35.,  36.,
        37.,  38.,  39.,  40.,  41.,  42.,  43.,  44.,  45.,  46.,  47.,
        48.,  49.,  50.,  51.,  52.,  53.,  54.,  55.,  56.,  57.,  58.,
        59.,  60.,  61.,  62.,  63.,  64.,  65.,  66.,  67.,  68.,  69.,
        70.,  71.,  72.,  73.,  74.,  75.,  76.,  77.,  78.,  79.,  80.,
        81.,  82.,  83.,  84.,  85.,  86.,  87.,  88.,  89.,  90.,  91.,
        92.,  93.,  94.,  95.,  96.,  97.,  98.,  99., 100., 101., 102.,
       103., 104., 105., 106., 107., 108., 109., 110., 111., 113., 114.,
       115., 116., 118., 119., 123., 124., 127., 128., 132., 133., 136.,
       137., 138., 140., 141., 143., 146., 147., 148., 151., 152., 156.,
       157., 159., 162., 168., 172., 175., 183., 186., 189., 199., 200.,
       201., 204., 207., 208., 209., 210., 212., 219., 220., 223., 226.,
       228., 229., 230., 231., 237., 239., 244.,  nan])

In [106]:
a = np.array(users['Age'].values.tolist())
print (a)
users['Age'] = np.where(a > 90, 0 , a).tolist()
print (users)

[nan 18. nan ... nan nan nan]
        userID                                          Location   Age
0            1                                nyc, new york, usa   NaN
1            2                         stockton, california, usa  18.0
2            3                   moscow, yukon territory, russia   NaN
3            4                         porto, v.n.gaia, portugal  17.0
4            5                farnborough, hants, united kingdom   NaN
5            6                     santa monica, california, usa  61.0
6            7                               washington, dc, usa   NaN
7            8                          timmins, ontario, canada   NaN
8            9                        germantown, tennessee, usa   NaN
9           10                        albacete, wisconsin, spain  26.0
10          11                    melbourne, victoria, australia  14.0
11          12                       fort bragg, california, usa   NaN
12          13                       barcelona, barcelona, spain  26.0
13          14                             mediapolis, iowa, usa   NaN
14          15                          calgary, alberta, canada   NaN
15          16                      albuquerque, new mexico, usa   NaN
16          17                         chesapeake, virginia, usa   NaN
17          18            rio de janeiro, rio de janeiro, brazil  25.0
18          19                                         weston, ,  14.0
19          20                      langhorne, pennsylvania, usa  19.0
20          21                    ferrol / spain, alabama, spain  46.0
21          22                       erfurt, thueringen, germany   NaN
22          23                   philadelphia, pennsylvania, usa   NaN
23          24                             cologne, nrw, germany  19.0
24          25                          oakland, california, usa  55.0
25          26                         bellevue, washington, usa   NaN
26          27                            chicago, illinois, usa  32.0
27          28             freiburg, baden-wuerttemberg, germany  24.0
28          29                       cuernavaca, alabama, mexico  19.0
29          30                            anchorage, alaska, usa  24.0
...        ...                                               ...   ...
278828  278829                                 boise, idaho, usa   NaN
278829  278830                         springield, virginia, usa  28.0
278830  278831                            anchorage, alaska, usa   NaN
278831  278832                    new smyrna beach, florida, usa  62.0
278832  278833      hanoi, australian capital territory, vietnam  25.0
278833  278834                           essen, england, germany   NaN
278834  278835                          karachi, sindh, pakistan  18.0
278835  278836                       des moines, washington, usa  47.0
278836  278837                            taiyuan, shanxi, china   NaN
278837  278838                              massillon, ohio, usa  15.0
278838  278839                                austin, texas, usa   NaN
278839  278840                        encinitas, california, usa  45.0
278840  278841  llangollen, denbighshire county, united kingdom.   NaN
278841  278842               perth, western australia, australia   NaN
278842  278843                      pismo beach, california, usa  28.0
278843  278844                          st. paul, minnesota, usa  28.0
278844  278845                       jrvenp, uusimaa, finland   NaN
278845  278846                          toronto, ontario, canada  23.0
278846  278847                           brooklyn, new york, usa   NaN
278847  278848                kln, nordrhein-westfalen, germany   NaN
278848  278849                       georgetown, ontario, canada  23.0
278849  278850                        sergnano, lombardia, italy   NaN
278850  278851                                dallas, texas, usa  33.0
278851  278852                   brisbane, queensland, australia  32.0
278852  278853                    stranraer, n/a, united kingdom  17.0
278853  278854                             portland, oregon, usa   NaN
278854  278855                tacoma, washington, united kingdom  50.0
278855  278856                         brampton, ontario, canada   NaN
278856  278857                         knoxville, tennessee, usa   NaN
278857  278858                              dublin, n/a, ireland   NaN

[278858 rows x 3 columns]

C:\Users\alok.1.pandey\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:3: RuntimeWarning: invalid value encountered in greater
  This is separate from the ipykernel package so we can avoid doing imports until

In [107]:
users['Age']= users['Age'].replace(0, np.nan) # replacing 0 with NAN
users

        userID                                          Location   Age
0            1                                nyc, new york, usa   NaN
1            2                         stockton, california, usa  18.0
2            3                   moscow, yukon territory, russia   NaN
3            4                         porto, v.n.gaia, portugal  17.0
4            5                farnborough, hants, united kingdom   NaN
5            6                     santa monica, california, usa  61.0
6            7                               washington, dc, usa   NaN
7            8                          timmins, ontario, canada   NaN
8            9                        germantown, tennessee, usa   NaN
9           10                        albacete, wisconsin, spain  26.0
10          11                    melbourne, victoria, australia  14.0
11          12                       fort bragg, california, usa   NaN
12          13                       barcelona, barcelona, spain  26.0
13          14                             mediapolis, iowa, usa   NaN
14          15                          calgary, alberta, canada   NaN
15          16                      albuquerque, new mexico, usa   NaN
16          17                         chesapeake, virginia, usa   NaN
17          18            rio de janeiro, rio de janeiro, brazil  25.0
18          19                                         weston, ,  14.0
19          20                      langhorne, pennsylvania, usa  19.0
20          21                    ferrol / spain, alabama, spain  46.0
21          22                       erfurt, thueringen, germany   NaN
22          23                   philadelphia, pennsylvania, usa   NaN
23          24                             cologne, nrw, germany  19.0
24          25                          oakland, california, usa  55.0
25          26                         bellevue, washington, usa   NaN
26          27                            chicago, illinois, usa  32.0
27          28             freiburg, baden-wuerttemberg, germany  24.0
28          29                       cuernavaca, alabama, mexico  19.0
29          30                            anchorage, alaska, usa  24.0
...        ...                                               ...   ...
278828  278829                                 boise, idaho, usa   NaN
278829  278830                         springield, virginia, usa  28.0
278830  278831                            anchorage, alaska, usa   NaN
278831  278832                    new smyrna beach, florida, usa  62.0
278832  278833      hanoi, australian capital territory, vietnam  25.0
278833  278834                           essen, england, germany   NaN
278834  278835                          karachi, sindh, pakistan  18.0
278835  278836                       des moines, washington, usa  47.0
278836  278837                            taiyuan, shanxi, china   NaN
278837  278838                              massillon, ohio, usa  15.0
278838  278839                                austin, texas, usa   NaN
278839  278840                        encinitas, california, usa  45.0
278840  278841  llangollen, denbighshire county, united kingdom.   NaN
278841  278842               perth, western australia, australia   NaN
278842  278843                      pismo beach, california, usa  28.0
278843  278844                          st. paul, minnesota, usa  28.0
278844  278845                       jrvenp, uusimaa, finland   NaN
278845  278846                          toronto, ontario, canada  23.0
278846  278847                           brooklyn, new york, usa   NaN
278847  278848                kln, nordrhein-westfalen, germany   NaN
278848  278849                       georgetown, ontario, canada  23.0
278849  278850                        sergnano, lombardia, italy   NaN
278850  278851                                dallas, texas, usa  33.0
278851  278852                   brisbane, queensland, australia  32.0
278852  278853                    stranraer, n/a, united kingdom  17.0
278853  278854                             portland, oregon, usa   NaN
278854  278855                tacoma, washington, united kingdom  50.0
278855  278856                         brampton, ontario, canada   NaN
278856  278857                         knoxville, tennessee, usa   NaN
278857  278858                              dublin, n/a, ireland   NaN

[278858 rows x 3 columns]

### Replace null values in column `Age` with mean

In [108]:
users['Age'] = users['Age'].fillna(users['Age'].mean())
users

        userID                                          Location        Age
0            1                                nyc, new york, usa  34.631546
1            2                         stockton, california, usa  18.000000
2            3                   moscow, yukon territory, russia  34.631546
3            4                         porto, v.n.gaia, portugal  17.000000
4            5                farnborough, hants, united kingdom  34.631546
5            6                     santa monica, california, usa  61.000000
6            7                               washington, dc, usa  34.631546
7            8                          timmins, ontario, canada  34.631546
8            9                        germantown, tennessee, usa  34.631546
9           10                        albacete, wisconsin, spain  26.000000
10          11                    melbourne, victoria, australia  14.000000
11          12                       fort bragg, california, usa  34.631546
12          13                       barcelona, barcelona, spain  26.000000
13          14                             mediapolis, iowa, usa  34.631546
14          15                          calgary, alberta, canada  34.631546
15          16                      albuquerque, new mexico, usa  34.631546
16          17                         chesapeake, virginia, usa  34.631546
17          18            rio de janeiro, rio de janeiro, brazil  25.000000
18          19                                         weston, ,  14.000000
19          20                      langhorne, pennsylvania, usa  19.000000
20          21                    ferrol / spain, alabama, spain  46.000000
21          22                       erfurt, thueringen, germany  34.631546
22          23                   philadelphia, pennsylvania, usa  34.631546
23          24                             cologne, nrw, germany  19.000000
24          25                          oakland, california, usa  55.000000
25          26                         bellevue, washington, usa  34.631546
26          27                            chicago, illinois, usa  32.000000
27          28             freiburg, baden-wuerttemberg, germany  24.000000
28          29                       cuernavaca, alabama, mexico  19.000000
29          30                            anchorage, alaska, usa  24.000000
...        ...                                               ...        ...
278828  278829                                 boise, idaho, usa  34.631546
278829  278830                         springield, virginia, usa  28.000000
278830  278831                            anchorage, alaska, usa  34.631546
278831  278832                    new smyrna beach, florida, usa  62.000000
278832  278833      hanoi, australian capital territory, vietnam  25.000000
278833  278834                           essen, england, germany  34.631546
278834  278835                          karachi, sindh, pakistan  18.000000
278835  278836                       des moines, washington, usa  47.000000
278836  278837                            taiyuan, shanxi, china  34.631546
278837  278838                              massillon, ohio, usa  15.000000
278838  278839                                austin, texas, usa  34.631546
278839  278840                        encinitas, california, usa  45.000000
278840  278841  llangollen, denbighshire county, united kingdom.  34.631546
278841  278842               perth, western australia, australia  34.631546
278842  278843                      pismo beach, california, usa  28.000000
278843  278844                          st. paul, minnesota, usa  28.000000
278844  278845                       jrvenp, uusimaa, finland  34.631546
278845  278846                          toronto, ontario, canada  23.000000
278846  278847                           brooklyn, new york, usa  34.631546
278847  278848                kln, nordrhein-westfalen, germany  34.631546
278848  278849                       georgetown, ontario, canada  23.000000
278849  278850                        sergnano, lombardia, italy  34.631546
278850  278851                                dallas, texas, usa  33.000000
278851  278852                   brisbane, queensland, australia  32.000000
278852  278853                    stranraer, n/a, united kingdom  17.000000
278853  278854                             portland, oregon, usa  34.631546
278854  278855                tacoma, washington, united kingdom  50.000000
278855  278856                         brampton, ontario, canada  34.631546
278856  278857                         knoxville, tennessee, usa  34.631546
278857  278858                              dublin, n/a, ireland  34.631546

[278858 rows x 3 columns]

### Change the datatype of `Age` to `int`

In [109]:
users ['Age']=users.Age.astype('int')

In [26]:
print(sorted(users.Age.unique()))

[5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90]

In [110]:
users.dtypes

userID       int64
Location    object
Age          int32
dtype: object

In [111]:
print(sorted(users.Age.unique()))

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90]

## Exploring the Ratings Dataset

### check the shape

In [27]:
ratings.shape

(1149780, 3)

In [28]:
n_users = users.shape[0]
n_books = books.shape[0]

In [29]:
ratings.head(5)

   userID        ISBN  bookRating
0  276725  034545104X           0
1  276726  0155061224           5
2  276727  0446520802           0
3  276729  052165615X           3
4  276729  0521795028           6

### Ratings dataset should have books only which exist in our books dataset. Drop the remaining rows

In [102]:
new_r=ratings.merge(right=books,how='inner',on='ISBN')
new_r.drop(columns=books.columns[1:],inplace=True,axis=1)
ratings = new_r
ratings.shape

(1031130, 3)

### Ratings dataset should have ratings from users which exist in users dataset. Drop the remaining rows

In [105]:
new_r=ratings.merge(right=users,how='inner',on='userID')
new_r.drop(columns=users.columns[1:],inplace=True,axis=1)
ratings = new_r
ratings.shape

(1149780, 3)

### Consider only ratings from 1-10 and leave 0s in column `bookRating`

In [112]:
ratings.drop(index=list(ratings[ratings['bookRating']==0].index),axis=0,inplace=True)

In [113]:
ratings[ratings['bookRating']==0]

Empty DataFrame
Columns: [userID, ISBN, bookRating]
Index: []

In [114]:
ratings.head()

   userID        ISBN  bookRating
1  276726  0155061224           5
3  276729  052165615X           3
4  276729  0521795028           6
6  276736  3257224281           8
7  276737  0600570967           6

### Find out which rating has been given highest number of times

In [116]:
ratings.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
userID,433671.0,135458.743451,80678.385078,8.0,66619.0,133184.0,205735.0,278854.0
bookRating,433671.0,7.601066,1.843798,1.0,7.0,8.0,9.0,10.0

In [117]:
ratings.groupby('bookRating')['userID'].count().sort_values(ascending=False).head()# 8 has been rated highest number of times

bookRating
8     103736
10     78610
7      76457
9      67541
5      50974
Name: userID, dtype: int64

### **Collaborative Filtering Based Recommendation Systems**

### For more accurate results only consider users who have rated atleast 100 books

In [118]:
g = ratings.groupby(by='userID')
new_grp={}
for each_key in g.indices.keys():
    if(len(g.indices[each_key])>=100):
        new_grp[each_key]=g.indices[each_key]

In [119]:
new_ratings = pd.DataFrame()
for each_key in new_grp.keys():
    new_ratings=new_ratings.append(ratings.iloc[new_grp[each_key]])

In [120]:
new_ratings.count()

userID        117645
ISBN          117645
bookRating    117645
dtype: int64

### Generating ratings matrix from explicit ratings

#### Note: since NaNs cannot be handled by training algorithms, replace these by 0, which indicates absence of ratings

In [121]:
new_ratings[new_ratings.bookRating.isna()]

Empty DataFrame
Columns: [userID, ISBN, bookRating]
Index: []

### Generate the predicted ratings using SVD with no.of singular values to be 50

In [125]:
reader = Reader(rating_scale=(new_ratings['bookRating'].min(), new_ratings['bookRating'].max()))
trainset = Dataset.load_from_df(new_ratings,reader)

In [128]:
algo = SVD()
algo.fit(trainset.build_full_trainset())

### Take a particular user_id

### Lets find the recommendations for user with id `2110`

#### Note: Execute the below cells to get the variables loaded

In [2]:
userID = 2110

In [3]:
user_id = 2 #2nd row in ratings matrix and predicted matrix

### Get the predicted ratings for userID `2110` and sort them in descending order

In [138]:
d = []
for each_isbn in books['ISBN']:
    d.append([each_isbn,round(algo.predict(userID,each_isbn).est)])

NameError: name 'userID' is not defined

In [139]:
predicted_df = pd.DataFrame(columns=['ISBN','Predicted_rating'],data=d)
predicted_df.head()

Empty DataFrame
Columns: [ISBN, Predicted_rating]
Index: []

In [140]:
predicted_df[predicted_df['Predicted_rating'].isna()]

Empty DataFrame
Columns: [ISBN, Predicted_rating]
Index: []

### Create a dataframe with name `user_data` containing userID `2110` explicitly interacted books

In [137]:
user_data=trainset.df[trainset.df['userID']==2110]

In [67]:
user_data.head()

       userID        ISBN  bookRating
14448    2110  0060987529           7
14449    2110  0064472779           8
14450    2110  0140022651          10
14452    2110  0142302163           8
14453    2110  0151008116           5

In [68]:
user_data.shape

(103, 3)

### Combine the user_data and and corresponding book data(`book_data`) in a single dataframe with name `user_full_info`

In [141]:
user_full_info = user_data.merge(on='ISBN',right=books)

In [142]:
book_data=user_full_info.drop(columns=['userID','bookRating'],axis=1)

In [70]:
book_data.shape

(103, 5)

In [71]:
book_data.head()

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher
246,0151008116,Life of Pi,Yann Martel,2002,Harcourt
904,015216250X,So You Want to Be a Wizard: The First Book in ...,Diane Duane,2001,Magic Carpet Books
1000,0064472779,All-American Girl,Meg Cabot,2003,HarperTrophy
1302,0345307674,Return of the Jedi (Star Wars),James Kahn,1983,Del Rey Books
1472,0671527215,Hitchhikers's Guide to the Galaxy,Douglas Adams,1984,Pocket

In [73]:
user_full_info.head()

,userID,ISBN,bookRating,bookTitle,bookAuthor,yearOfPublication,publisher
0,2110,0060987529,7,Confessions of an Ugly Stepsister : A Novel,Gregory Maguire,2000,Regan Books
1,2110,0064472779,8,All-American Girl,Meg Cabot,2003,HarperTrophy
2,2110,0140022651,10,Journey to the Center of the Earth,Jules Verne,1965,Penguin Books
3,2110,0142302163,8,The Ghost Sitter,Peni R. Griffin,2002,Puffin Books
4,2110,0151008116,5,Life of Pi,Yann Martel,2002,Harcourt

### Get top 10 recommendations for above given userID from the books not already rated by that user

In [143]:
books_not_rated = pd.concat([books,book_data]).drop_duplicates(keep=False)

In [144]:
books_not_rated=books_not_rated.merge(right=predicted_df,on='ISBN')

In [145]:
books_not_rated.nlargest(10,columns='Predicted_rating')

TypeError: Column 'Predicted_rating' has dtype object, cannot use method 'nlargest' with this dtype